/*参照するライブラリを指定*/
#include <stdio.h>

/*戻り値の型　関数名　(引数の型)*/
int main(void)
{
	/*宣言*/
	/*型　配列名　[配列の大きさ]*/
	int	a[5];

	/*繰り返し構文用の添え字*/
	int	i;
	int	ans;
	/*この書き方であればiは10未満、つまり9まで動く*/
	for (i = 0; i < 5; i++)
			a[i] = i;

	/*解答格納用の変数を宣言*/
	int ans;
	/*変数を初期化、しないとゴミ(変な値)が入っている*/
	ans = 0;
	/*繰り返し構文と計算の組み合わせ*/
	for (i = 0; i < 5; i++)
	{
		/*配列の値の確認*/
		printf("a[%d] = %d\n", i, a[i]);
		/*ansにa[i]を足していく*/
		ans += a[i];
	}
	/*結果の表示！*/
	printf("%d\n",ans);

	/*main関数の戻り値*/
	return 0;
}

